# CreateHemisphere

## Description
Function CreateHemisphere creates a new hemisphere object in a Vectorworks document. &lt;BR&gt;

```pascal
FUNCTION CreateHemisphere(
				center : REAL;
				top    : REAL) : HANDLE;
```

```python

def vs.CreateHemisphere(center, top):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|center|REAL|Center point of hemisphere.|
|top|REAL|Top point of hemisphere.|

## Returns
The function returns a handle to the new hemisphere object.

## Remarks
[sd 8/18/98]

## Version
Availability: from VectorWorks8.0
## Category
* Objects - Solids